Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/prison_system/prison_education_services.html.txt.tmx
Source language: en
Languages: ga

source: Work-training and education are the two main activities in prison
ga: Tá oiliúint oibre agus oideachas ar an dá phríomh-ghníomhaíocht sna príosúin

source: Many prisoners voluntarily take part in education programmes
ga: Glacann príosúnaigh go leor páirt i gcláir oideachais dá ndeoin féin

source: In fact, everyone who is committed to custody is entitled to, and encouraged to participate in the extensive educational opportunities available
ga: Go deimhin féin, bíonn gach duine a chuirtear faoi choimeád i dteideal, agus spreagtar iad chun páirt a ghlacadh sna deiseanna oideachais forleathana a bhíonn ar fáil

source: The Irish prison system works in partnership with a range of educational agencies (for example, community colleges, public libraries, Education and Training Boards) to provide a broad programme of education
ga: Oibríonn córas phríosúin na hÉireann i gcomhpháirtíocht le réimse gníomhaireachtaí oideachais (mar shampla, coláistí pobail, leabharlanna poiblí, Boird Oideachais agus Oiliúna) chun clár leathan oideachais a sholáthar

source: Prisoners may take classes ranging from basic literacy to Open University degrees
ga: Is féidir le príosúnaigh ranganna a thógáil a chlúdaíonn réimse idir litearthacht bhunúsachagus céimeanna ón Open University

source: The education curriculum includes physical education, health education, social education (with subjects such as Home Economics) and creative activities (art, drama, music and writing)
ga: Áirítear leis an gcuraclam oideachais oideachas fisiciúil, oideachas sláinte, oideachais sóisialta (le hábhair ar nós na hEacnamaíochta Baile) agus gníomhaíochtaí cruthaitheacha (ealaíon, dráma, ceol agus scríbhneoireacht)

source: Prisoners may also study the conventional school subjects leading to Junior Certificate and Leaving Certificate Examinations and Quality and Qualifications Ireland (QQI) accreditation
ga: Is féidir le príosúnaigh staidéar a dhéanamh ar na gnáthábhair scoile a thugtar don Teastas Sóisearachagus Scrúduithe na hArdteistiméireachta agus creidiúnú Dearbhú Cáilíochta agus Cháilíochtaí Éireann (DCCE)

source: In addition, pre-release courses on addiction, health issues and offending behaviour are provided
ga: Tá tuairim is 181 múinteoir lánaimseartha ón gcoiste gairmoideachais ag múineadh agus ag déanamh léachtóireacht ar phríosúnaithe

source: The aim of the programmes is to help prisoners cope with their sentences and prepare them for release
ga: Cuireann an comhairle Ealaíon ceardlainn scríbhneoireachta ar fáil agus tá siad stiúrtha ag scríbhneoirí agus ealaíontóirí aitheanta

source: The Prison Rules 2007 (SI No. 252/2007), published by the Department of Justice, describe the education and library services that prisons should try (as far is practible) to provide for prisoners
ga: Tá rialacha príosúin 2007 (SI 252/2007) foilsithe ag an Roinn Dlí agus Cirt, agus déanann siad seo cur síos ar na seirbhísí oideachais agus leabharlainne ar chóir do phríosúin iarracht a dhéanamh (chomh fada agus is féidir) a sholáthar do phríosúnaigh

source: Aim of prison education services
ga: Aidhm sheirbhísí oideachais phríosúin

source: Educational programmes in prison are aimed at helping prisoners cope with their sentences and prepare them for release
ga: Tá cláir oideachais i bpríosúin dírithe ar chabhrú le príosúnaigh déileáil lena bpianbhreith agus iad a réiteach i gcomhair a bheith scaoilte saor

source: In particular, these programmes offer them opportunities to discover and develop new skills
ga: Go háirithe, cuireann na cláir seo deiseanna ar fáil dóibh scileanna nua a aimsiú agus a fhorbairt

source: Methods and approaches used to encourage prisoners to enter these programmes are drawn from adult and communication education
ga: Tá na modhanna agus cur chuige a úsáidtear chun príosúnaigh a spreagadh chun cur isteach ar na cláir seo bunaithe ar oideachas do dhaoine fásta agus cumarsáide

source: Participation in all programmes is voluntary
ga: Tá rannpháirtíocht i ngach clár deonach

source: Teachers from Education and Training Boards teach and lecture prisoners
ga: Múinteoirí ó Boird Oideachais agus Oiliúna a bhíonn ag múineadh agus ag léachtóireacht do phríosúnaigh

source: Other agencies contribute to prison education such as the Public Library Services and the Open University, which provides a wide range of degree courses
ga: Tá gníomhaireachtaí eile ag cur le hoideachas príosúin, ar nós na Seirbhísí Leabharlainne Poiblíagus an Open University, a sholáthraíonn réimse leathan cúrsaí céime

source: The Arts Council also provides writers' workshops, conducted by recognised writers and artists
ga: Soláthraíonn an Chomhairle Ealaíon ceardlanna do scríbhneoirí, arna reáchtáil ag scríbhneoirí agus ealaíontóirí aitheanta

source: Objectives of prison education services
ga: Cuspóirí sheirbhísí oideachais phríosúin

source: Prison education has grown and developed greatly in recent years
ga: Tá fás agus forbairt shuntasach tagtha ar oideachas phríosúin le blianta beaga anuas

source: The 50% participation rate among Irish prisoners is very high by international standards
ga: Tá an ráta 50% rannpháirtíochta i measc phríosúnaigh Éireannacha an-ard de réir caighdeáin idirnáisiúnta
